una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9xe128.h
#ifdef __IAR_SYSTEMS_ASM__

/* - Hardware register definition*/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* - ******************************************************************************/
/* - -------- GPBR : (SYS Offset: 0x1350) GPBR General Purpose Register -------- */
/* - -------- GPBR : (SYS Offset: 0x1354) GPBR General Purpose Register -------- */
/* - -------- GPBR : (SYS Offset: 0x1358) GPBR General Purpose Register -------- */
/* - -------- GPBR : (SYS Offset: 0x135c) GPBR General Purpose Register -------- */

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR External Bus Interface*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Error Correction Code controller*/
/* - ******************************************************************************/
/* - -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- */
AT91C_ECC_RST             EQU (0x1 <<  0) ;- (ECC) ECC reset parity
/* - -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- */
AT91C_ECC_PAGE_SIZE       EQU (0x3 <<  0) ;- (ECC) Nand Flash page size
/* - -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- */
AT91C_ECC_RECERR          EQU (0x1 <<  0) ;- (ECC) ECC error
AT91C_ECC_ECCERR          EQU (0x1 <<  1) ;- (ECC) ECC single error
AT91C_ECC_MULERR          EQU (0x1 <<  2) ;- (ECC) ECC_MULERR
/* - -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- */
AT91C_ECC_BITADDR         EQU (0xF <<  0) ;- (ECC) Bit address error
AT91C_ECC_WORDADDR        EQU (0xFFF <<  4) ;- (ECC) address of the failing bit
/* - -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- */
AT91C_ECC_NPARITY         EQU (0xFFFF <<  0) ;- (ECC) ECC parity N 
/* - -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- */
AT91C_ECC_VR              EQU (0xF <<  0) ;- (ECC) ECC version register

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR SDRAM Controller Interface*/
/* - ******************************************************************************/
/* - -------- SDRAMC_MR : (SDRAMC Offset: 0x0) SDRAM Controller Mode Register -------- */
AT91C_SDRAMC_MODE         EQU (0xF <<  0) ;- (SDRAMC) Mode
AT91C_SDRAMC_MODE_NORMAL_CMD EQU (0x0) ;- (SDRAMC) Normal Mode
AT91C_SDRAMC_MODE_NOP_CMD EQU (0x1) ;- (SDRAMC) Issue a NOP Command at every access
AT91C_SDRAMC_MODE_PRCGALL_CMD EQU (0x2) ;- (SDRAMC) Issue a All Banks Precharge Command at every access
AT91C_SDRAMC_MODE_LMR_CMD EQU (0x3) ;- (SDRAMC) Issue a Load Mode Register at every access
AT91C_SDRAMC_MODE_RFSH_CMD EQU (0x4) ;- (SDRAMC) Issue a Refresh
AT91C_SDRAMC_MODE_EXT_LMR_CMD EQU (0x5) ;- (SDRAMC) Issue an Extended Load Mode Register
AT91C_SDRAMC_MODE_DEEP_CMD EQU (0x6) ;- (SDRAMC) Enter Deep Power Mode
/* - -------- SDRAMC_TR : (SDRAMC Offset: 0x4) SDRAMC Refresh Timer Register -------- */
AT91C_SDRAMC_COUNT        EQU (0xFFF <<  0) ;- (SDRAMC) Refresh Counter
/* - -------- SDRAMC_CR : (SDRAMC Offset: 0x8) SDRAM Configuration Register -------- */
AT91C_SDRAMC_NC           EQU (0x3 <<  0) ;- (SDRAMC) Number of Column Bits
AT91C_SDRAMC_NC_8         EQU (0x0) ;- (SDRAMC) 8 Bits
AT91C_SDRAMC_NC_9         EQU (0x1) ;- (SDRAMC) 9 Bits
AT91C_SDRAMC_NC_10        EQU (0x2) ;- (SDRAMC) 10 Bits
AT91C_SDRAMC_NC_11        EQU (0x3) ;- (SDRAMC) 11 Bits
AT91C_SDRAMC_NR           EQU (0x3 <<  2) ;- (SDRAMC) Number of Row Bits
AT91C_SDRAMC_NR_11        EQU (0x0 <<  2) ;- (SDRAMC) 11 Bits
AT91C_SDRAMC_NR_12        EQU (0x1 <<  2) ;- (SDRAMC) 12 Bits
AT91C_SDRAMC_NR_13        EQU (0x2 <<  2) ;- (SDRAMC) 13 Bits
AT91C_SDRAMC_NB           EQU (0x1 <<  4) ;- (SDRAMC) Number of Banks
AT91C_SDRAMC_NB_2_BANKS   EQU (0x0 <<  4) ;- (SDRAMC) 2 banks
AT91C_SDRAMC_NB_4_BANKS   EQU (0x1 <<  4) ;- (SDRAMC) 4 banks
AT91C_SDRAMC_CAS          EQU (0x3 <<  5) ;- (SDRAMC) CAS Latency
AT91C_SDRAMC_CAS_2        EQU (0x2 <<  5) ;- (SDRAMC) 2 cycles
AT91C_SDRAMC_CAS_3        EQU (0x3 <<  5) ;- (SDRAMC) 3 cycles
AT91C_SDRAMC_DBW          EQU (0x1 <<  7) ;- (SDRAMC) Data Bus Width
AT91C_SDRAMC_DBW_32_BITS  EQU (0x0 <<  7) ;- (SDRAMC) 32 Bits datas bus
AT91C_SDRAMC_DBW_16_BITS  EQU (0x1 <<  7) ;- (SDRAMC) 16 Bits datas bus
AT91C_SDRAMC_TWR          EQU (0xF <<  8) ;- (SDRAMC) Number of Write Recovery Time Cycles
AT91C_SDRAMC_TWR_0        EQU (0x0 <<  8) ;- (SDRAMC) Value :  0
AT91C_SDRAMC_TWR_1        EQU (0x1 <<  8) ;- (SDRAMC) Value :  1
AT91C_SDRAMC_TWR_2        EQU (0x2 <<  8) ;- (SDRAMC) Value :  2
AT91C_SDRAMC_TWR_3        EQU (0x3 <<  8) ;- (SDRAMC) Value :  3
AT91C_SDRAMC_TWR_4        EQU (0x4 <<  8) ;- (SDRAMC) Value :  4
AT91C_SDRAMC_TWR_5        EQU (0x5 <<  8) ;- (SDRAMC) Value :  5
AT91C_SDRAMC_TWR_6        EQU (0x6 <<  8) ;- (SDRAMC) Value :  6
AT91C_SDRAMC_TWR_7        EQU (0x7 <<  8) ;- (SDRAMC) Value :  7
AT91C_SDRAMC_TWR_8        EQU (0x8 <<  8) ;- (SDRAMC) Value :  8
AT91C_SDRAMC_TWR_9        EQU (0x9 <<  8) ;- (SDRAMC) Value :  9
AT91C_SDRAMC_TWR_10       EQU (0xA <<  8) ;- (SDRAMC) Value : 10
AT91C_SDRAMC_TWR_11       EQU (0xB <<  8) ;- (SDRAMC) Value : 11
AT91C_SDRAMC_TWR_12       EQU (0xC <<  8) ;- (SDRAMC) Value : 12
AT91C_SDRAMC_TWR_13       EQU (0xD <<  8) ;- (SDRAMC) Value : 13
AT91C_SDRAMC_TWR_14       EQU (0xE <<  8) ;- (SDRAMC) Value : 14
AT91C_SDRAMC_TWR_15       EQU (0xF <<  8) ;- (SDRAMC) Value : 15
AT91C_SDRAMC_TRC          EQU (0xF << 12) ;- (SDRAMC) Number of RAS Cycle Time Cycles
AT91C_SDRAMC_TRC_0        EQU (0x0 << 12) ;- (SDRAMC) Value :  0
AT91C_SDRAMC_TRC_1        EQU (0x1 << 12) ;- (SDRAMC) Value :  1
AT91C_SDRAMC_TRC_2        EQU (0x2 << 12) ;- (SDRAMC) Value :  2
AT91C_SDRAMC_TRC_3        EQU (0x3 << 12) ;- (SDRAMC) Value :  3
AT91C_SDRAMC_TRC_4        EQU (0x4 << 12) ;- (SDRAMC) Value :  4
AT91C_SDRAMC_TRC_5        EQU (0x5 << 12) ;- (SDRAMC) Value :  5
AT91C_SDRAMC_TRC_6        EQU (0x6 << 12) ;- (SDRAMC) Value :  6
AT91C_SDRAMC_TRC_7        EQU (0x7 << 12) ;- (SDRAMC) Value :  7
AT91C_SDRAMC_TRC_8        EQU (0x8 << 12) ;- (SDRAMC) Value :  8
AT91C_SDRAMC_TRC_9        EQU (0x9 << 12) ;- (SDRAMC) Value :  9
AT91C_SDRAMC_TRC_10       EQU (0xA << 12) ;- (SDRAMC) Value : 10
AT91C_SDRAMC_TRC_11       EQU (0xB << 12) ;- (SDRAMC) Value : 11
AT91C_SDRAMC_TRC_12       EQU (0xC << 12) ;- (SDRAMC) Value : 12
AT91C_SDRAMC_TRC_13       EQU (0xD << 12) ;- (SDRAMC) Value : 13
AT91C_SDRAMC_TRC_14       EQU (0xE << 12) ;- (SDRAMC) Value : 14
AT91C_SDRAMC_TRC_15       EQU (0xF << 12) ;- (SDRAMC) Value : 15
AT91C_SDRAMC_TRP          EQU (0xF << 16) ;- (SDRAMC) Number of RAS Precharge Time Cycles
AT91C_SDRAMC_TRP_0        EQU (0x0 << 16) ;- (SDRAMC) Value :  0
AT91C_SDRAMC_TRP_1        EQU (0x1 << 16) ;- (SDRAMC) Value :  1
AT91C_SDRAMC_TRP_2        EQU (0x2 << 16) ;- (SDRAMC) Value :  2
AT91C_SDRAMC_TRP_3        EQU (0x3 << 16) ;- (SDRAMC) Value :  3
AT91C_SDRAMC_TRP_4        EQU (0x4 << 16) ;- (SDRAMC) Value :  4
AT91C_SDRAMC_TRP_5        EQU (0x5 << 16) ;- (SDRAMC) Value :  5
AT91C_SDRAMC_TRP_6        EQU (0x6 << 16) ;- (SDRAMC) Value :  6
AT91C_SDRAMC_TRP_7        EQU (0x7 << 16) ;- (SDRAMC) Value :  7
AT91C_SDRAMC_TRP_8        EQU (0x8 << 16) ;- (SDRAMC) Value :  8
AT91C_SDRAMC_TRP_9        EQU (0x9 << 16) ;- (SDRAMC) Value :  9
AT91C_SDRAMC_TRP_10       EQU (0xA << 16) ;- (SDRAMC) Value : 10
AT91C_SDRAMC_TRP_11       EQU (0xB << 16) ;- (SDRAMC) Value : 11
AT91C_SDRAMC_TRP_12       EQU (0xC << 16) ;- (SDRAMC) Value : 12
AT91C_SDRAMC_TRP_13       EQU (0xD << 16) ;- (SDRAMC) Value : 13
AT91C_SDRAMC_TRP_14       EQU (0xE << 16) ;- (SDRAMC) Value : 14
AT91C_SDRAMC_TRP_15       EQU (0xF << 16) ;- (SDRAMC) Value : 15
AT91C_SDRAMC_TRCD         EQU (0xF << 20) ;- (SDRAMC) Number of RAS to CAS Delay Cycles
AT91C_SDRAMC_TRCD_0       EQU (0x0 << 20) ;- (SDRAMC) Value :  0
AT91C_SDRAMC_TRCD_1       EQU (0x1 << 20) ;- (SDRAMC) Value :  1
AT91C_SDRAMC_TRCD_2       EQU (0x2 << 20) ;- (SDRAMC) Value :  2
AT91C_SDRAMC_TRCD_3       EQU (0x3 << 20) ;- (SDRAMC) Value :  3
AT91C_SDRAMC_TRCD_4       EQU (0x4 << 20) ;- (SDRAMC) Value :  4
AT91C_SDRAMC_TRCD_5       EQU (0x5 << 20) ;- (SDRAMC) Value :  5
AT91C_SDRAMC_TRCD_6       EQU (0x6 << 20) ;- (SDRAMC) Value :  6
AT91C_SDRAMC_TRCD_7       EQU (0x7 << 20) ;- (SDRAMC) Value :  7
AT91C_SDRAMC_TRCD_8       EQU (0x8 << 20) ;- (SDRAMC) Value :  8
AT91C_SDRAMC_TRCD_9       EQU (0x9 << 20) ;- (SDRAMC) Value :  9
AT91C_SDRAMC_TRCD_10      EQU (0xA << 20) ;- (SDRAMC) Value : 10
AT91C_SDRAMC_TRCD_11      EQU (0xB << 20) ;- (SDRAMC) Value : 11
AT91C_SDRAMC_TRCD_12      EQU (0xC << 20) ;- (SDRAMC) Value : 12
AT91C_SDRAMC_TRCD_13      EQU (0xD << 20) ;- (SDRAMC) Value : 13
AT91C_SDRAMC_TRCD_14      EQU (0xE << 20) ;- (SDRAMC) Value : 14
AT91C_SDRAMC_TRCD_15      EQU (0xF << 20) ;- (SDRAMC) Value : 15
AT91C_SDRAMC_TRAS         EQU (0xF << 24) ;- (SDRAMC) Number of RAS Active Time Cycles
AT91C_SDRAMC_TRAS_0       EQU (0x0 << 24) ;- (SDRAMC) Value :  0
AT91C_SDRAMC_TRAS_1       EQU (0x1 << 24) ;- (SDRAMC) Value :  1
AT91C_SDRAMC_TRAS_2       EQU (0x2 << 24) ;- (SDRAMC) Value :  2
AT91C_SDRAMC_TRAS_3       EQU (0x3 << 24) ;- (SDRAMC) Value :  3
AT91C_SDRAMC_TRAS_4       EQU (0x4 << 24) ;- (SDRAMC) Value :  4
AT91C_SDRAMC_TRAS_5       EQU (0x5 << 24) ;- (SDRAMC) Value :  5
AT91C_SDRAMC_TRAS_6       EQU (0x6 << 24) ;- (SDRAMC) Value :  6
AT91C_SDRAMC_TRAS_7       EQU (0x7 << 24) ;- (SDRAMC) Value :  7
AT91C_SDRAMC_TRAS_8       EQU (0x8 << 24) ;- (SDRAMC) Value :  8
AT91C_SDRAMC_TRAS_9       EQU (0x9 << 24) ;- (SDRAMC) Value :  9
AT91C_SDRAMC_TRAS_10      EQU (0xA << 24) ;- (SDRAMC) Value : 10
AT91C_SDRAMC_TRAS_11      EQU (0xB << 24) ;- (SDRAMC) Value : 11
AT91C_SDRAMC_TRAS_12      EQU (0xC << 24) ;- (SDRAMC) Value : 12
AT91C_SDRAMC_TRAS_13      EQU (0xD << 24) ;- (SDRAMC) Value : 13
AT91C_SDRAMC_TRAS_14      EQU (0xE << 24) ;- (SDRAMC) Value : 14
AT91C_SDRAMC_TRAS_15      EQU (0xF << 24) ;- (SDRAMC) Value : 15
AT91C_SDRAMC_TXSR         EQU (0xF << 28) ;- (SDRAMC) Number of Command Recovery Time Cycles
AT91C_SDRAMC_TXSR_0       EQU (0x0 << 28) ;- (SDRAMC) Value :  0
AT91C_SDRAMC_TXSR_1       EQU (0x1 << 28) ;- (SDRAMC) Value :  1
AT91C_SDRAMC_TXSR_2       EQU (0x2 << 28) ;- (SDRAMC) Value :  2
AT91C_SDRAMC_TXSR_3       EQU (0x3 << 28) ;- (SDRAMC) Value :  3
AT91C_SDRAMC_TXSR_4       EQU (0x4 << 28) ;- (SDRAMC) Value :  4
AT91C_SDRAMC_TXSR_5       EQU (0x5 << 28) ;- (SDRAMC) Value :  5
AT91C_SDRAMC_TXSR_6       EQU (0x6 << 28) ;- (SDRAMC) Value :  6
AT91C_SDRAMC_TXSR_7       EQU (0x7 << 28) ;- (SDRAMC) Value :  7
AT91C_SDRAMC_TXSR_8       EQU (0x8 << 28) ;- (SDRAMC) Value :  8
AT91C_SDRAMC_TXSR_9       EQU (0x9 << 28) ;- (SDRAMC) Value :  9
AT91C_SDRAMC_TXSR_10      EQU (0xA << 28) ;- (SDRAMC) Value : 10
AT91C_SDRAMC_TXSR_11      EQU (0xB << 28) ;- (SDRAMC) Value : 11
AT91C_SDRAMC_TXSR_12      EQU (0xC << 28) ;- (SDRAMC) Value : 12
AT91C_SDRAMC_TXSR_13      EQU (0xD << 28) ;- (SDRAMC) Value : 13
AT91C_SDRAMC_TXSR_14      EQU (0xE << 28) ;- (SDRAMC) Value : 14
AT91C_SDRAMC_TXSR_15      EQU (0xF << 28) ;- (SDRAMC) Value : 15
/* - -------- SDRAMC_HSR : (SDRAMC Offset: 0xc) SDRAM Controller High Speed Register -------- */
AT91C_SDRAMC_DA           EQU (0x1 <<  0) ;- (SDRAMC) Decode Cycle Enable Bit
AT91C_SDRAMC_DA_DISABLE   EQU (0x0) ;- (SDRAMC) Disable Decode Cycle
AT91C_SDRAMC_DA_ENABLE    EQU (0x1) ;- (SDRAMC) Enable Decode Cycle
/* - -------- SDRAMC_LPR : (SDRAMC Offset: 0x10) SDRAM Controller Low-power Register -------- */
AT91C_SDRAMC_LPCB         EQU (0x3 <<  0) ;- (SDRAMC) Low-power Configurations
AT91C_SDRAMC_LPCB_DISABLE EQU (0x0) ;- (SDRAMC) Disable Low Power Features
AT91C_SDRAMC_LPCB_SELF_REFRESH EQU (0x1) ;- (SDRAMC) Enable SELF_REFRESH
AT91C_SDRAMC_LPCB_POWER_DOWN EQU (0x2) ;- (SDRAMC) Enable POWER_DOWN
AT91C_SDRAMC_LPCB_DEEP_POWER_DOWN EQU (0x3) ;- (SDRAMC) Enable DEEP_POWER_DOWN
AT91C_SDRAMC_PASR         EQU (0x7 <<  4) ;- (SDRAMC) Partial Array Self Refresh (only for Low Power SDRAM)
AT91C_SDRAMC_TCSR         EQU (0x3 <<  8) ;- (SDRAMC) Temperature Compensated Self Refresh (only for Low Power SDRAM)
AT91C_SDRAMC_DS           EQU (0x3 << 10) ;- (SDRAMC) Drive Strenght (only for Low Power SDRAM)
AT91C_SDRAMC_TIMEOUT      EQU (0x3 << 12) ;- (SDRAMC) Time to define when Low Power Mode is enabled
AT91C_SDRAMC_TIMEOUT_0_CLK_CYCLES EQU (0x0 << 12) ;- (SDRAMC) Activate SDRAM Low Power Mode Immediately
AT91C_SDRAMC_TIMEOUT_64_CLK_CYCLES EQU (0x1 << 12) ;- (SDRAMC) Activate SDRAM Low Power Mode after 64 clock cycles after the end of the last transfer
AT91C_SDRAMC_TIMEOUT_128_CLK_CYCLES EQU (0x2 << 12) ;- (SDRAMC) Activate SDRAM Low Power Mode after 64 clock cycles after the end of the last transfer
/* - -------- SDRAMC_IER : (SDRAMC Offset: 0x14) SDRAM Controller Interrupt Enable Register -------- */
AT91C_SDRAMC_RES          EQU (0x1 <<  0) ;- (SDRAMC) Refresh Error Status
/* - -------- SDRAMC_IDR : (SDRAMC Offset: 0x18) SDRAM Controller Interrupt Disable Register -------- */
/* - -------- SDRAMC_IMR : (SDRAMC Offset: 0x1c) SDRAM Controller Interrupt Mask Register -------- */
/* - -------- SDRAMC_ISR : (SDRAMC Offset: 0x20) SDRAM Controller Interrupt Status Register -------- */
/* - -------- SDRAMC_MDR : (SDRAMC Offset: 0x24) SDRAM Controller Memory Device Register -------- */
AT91C_SDRAMC_MD           EQU (0x3 <<  0) ;- (SDRAMC) Memory Device Type
AT91C_SDRAMC_MD_SDRAM     EQU (0x0) ;- (SDRAMC) SDRAM Mode
AT91C_SDRAMC_MD_LOW_POWER_SDRAM EQU (0x1) ;- (SDRAMC) SDRAM Low Power Mode

