una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/Atmel/ioat91sam9xe128.h
AT91C_SPI1_PTSR           EQU (0xFFFCC124) ;- (PDC_SPI1) PDC Transfer Status Register
AT91C_SPI1_TNCR           EQU (0xFFFCC11C) ;- (PDC_SPI1) Transmit Next Counter Register
AT91C_SPI1_RPR            EQU (0xFFFCC100) ;- (PDC_SPI1) Receive Pointer Register
AT91C_SPI1_TCR            EQU (0xFFFCC10C) ;- (PDC_SPI1) Transmit Counter Register
AT91C_SPI1_RNCR           EQU (0xFFFCC114) ;- (PDC_SPI1) Receive Next Counter Register
AT91C_SPI1_TNPR           EQU (0xFFFCC118) ;- (PDC_SPI1) Transmit Next Pointer Register
/* - ========== Register definition for SPI1 peripheral ========== */
AT91C_SPI1_IER            EQU (0xFFFCC014) ;- (SPI1) Interrupt Enable Register
AT91C_SPI1_RDR            EQU (0xFFFCC008) ;- (SPI1) Receive Data Register
AT91C_SPI1_SR             EQU (0xFFFCC010) ;- (SPI1) Status Register
AT91C_SPI1_IMR            EQU (0xFFFCC01C) ;- (SPI1) Interrupt Mask Register
AT91C_SPI1_TDR            EQU (0xFFFCC00C) ;- (SPI1) Transmit Data Register
AT91C_SPI1_IDR            EQU (0xFFFCC018) ;- (SPI1) Interrupt Disable Register
AT91C_SPI1_CSR            EQU (0xFFFCC030) ;- (SPI1) Chip Select Register
AT91C_SPI1_CR             EQU (0xFFFCC000) ;- (SPI1) Control Register
AT91C_SPI1_MR             EQU (0xFFFCC004) ;- (SPI1) Mode Register
/* - ========== Register definition for PDC_ADC peripheral ========== */
AT91C_ADC_PTCR            EQU (0xFFFE0120) ;- (PDC_ADC) PDC Transfer Control Register
AT91C_ADC_TPR             EQU (0xFFFE0108) ;- (PDC_ADC) Transmit Pointer Register
AT91C_ADC_TCR             EQU (0xFFFE010C) ;- (PDC_ADC) Transmit Counter Register
AT91C_ADC_RCR             EQU (0xFFFE0104) ;- (PDC_ADC) Receive Counter Register
AT91C_ADC_PTSR            EQU (0xFFFE0124) ;- (PDC_ADC) PDC Transfer Status Register
AT91C_ADC_RNPR            EQU (0xFFFE0110) ;- (PDC_ADC) Receive Next Pointer Register
AT91C_ADC_RPR             EQU (0xFFFE0100) ;- (PDC_ADC) Receive Pointer Register
AT91C_ADC_TNCR            EQU (0xFFFE011C) ;- (PDC_ADC) Transmit Next Counter Register
AT91C_ADC_RNCR            EQU (0xFFFE0114) ;- (PDC_ADC) Receive Next Counter Register
AT91C_ADC_TNPR            EQU (0xFFFE0118) ;- (PDC_ADC) Transmit Next Pointer Register
/* - ========== Register definition for ADC peripheral ========== */
AT91C_ADC_CHDR            EQU (0xFFFE0014) ;- (ADC) ADC Channel Disable Register
AT91C_ADC_CDR3            EQU (0xFFFE003C) ;- (ADC) ADC Channel Data Register 3
AT91C_ADC_CR              EQU (0xFFFE0000) ;- (ADC) ADC Control Register
AT91C_ADC_IMR             EQU (0xFFFE002C) ;- (ADC) ADC Interrupt Mask Register
AT91C_ADC_CDR2            EQU (0xFFFE0038) ;- (ADC) ADC Channel Data Register 2
AT91C_ADC_SR              EQU (0xFFFE001C) ;- (ADC) ADC Status Register
AT91C_ADC_IER             EQU (0xFFFE0024) ;- (ADC) ADC Interrupt Enable Register
AT91C_ADC_CDR7            EQU (0xFFFE004C) ;- (ADC) ADC Channel Data Register 7
AT91C_ADC_CDR0            EQU (0xFFFE0030) ;- (ADC) ADC Channel Data Register 0
AT91C_ADC_CDR5            EQU (0xFFFE0044) ;- (ADC) ADC Channel Data Register 5
AT91C_ADC_CDR4            EQU (0xFFFE0040) ;- (ADC) ADC Channel Data Register 4
AT91C_ADC_CHER            EQU (0xFFFE0010) ;- (ADC) ADC Channel Enable Register
AT91C_ADC_CHSR            EQU (0xFFFE0018) ;- (ADC) ADC Channel Status Register
AT91C_ADC_MR              EQU (0xFFFE0004) ;- (ADC) ADC Mode Register
AT91C_ADC_CDR6            EQU (0xFFFE0048) ;- (ADC) ADC Channel Data Register 6
AT91C_ADC_LCDR            EQU (0xFFFE0020) ;- (ADC) ADC Last Converted Data Register
AT91C_ADC_CDR1            EQU (0xFFFE0034) ;- (ADC) ADC Channel Data Register 1
AT91C_ADC_IDR             EQU (0xFFFE0028) ;- (ADC) ADC Interrupt Disable Register
/* - ========== Register definition for EMACB peripheral ========== */
AT91C_EMACB_USRIO         EQU (0xFFFC40C0) ;- (EMACB) USER Input/Output Register
AT91C_EMACB_RSE           EQU (0xFFFC4074) ;- (EMACB) Receive Symbol Errors Register
AT91C_EMACB_SCF           EQU (0xFFFC4044) ;- (EMACB) Single Collision Frame Register
AT91C_EMACB_STE           EQU (0xFFFC4084) ;- (EMACB) SQE Test Error Register
AT91C_EMACB_SA1H          EQU (0xFFFC409C) ;- (EMACB) Specific Address 1 Top, Last 2 bytes
AT91C_EMACB_ROV           EQU (0xFFFC4070) ;- (EMACB) Receive Overrun Errors Register
AT91C_EMACB_TBQP          EQU (0xFFFC401C) ;- (EMACB) Transmit Buffer Queue Pointer
AT91C_EMACB_IMR           EQU (0xFFFC4030) ;- (EMACB) Interrupt Mask Register
AT91C_EMACB_IER           EQU (0xFFFC4028) ;- (EMACB) Interrupt Enable Register
AT91C_EMACB_REV           EQU (0xFFFC40FC) ;- (EMACB) Revision Register
AT91C_EMACB_SA3L          EQU (0xFFFC40A8) ;- (EMACB) Specific Address 3 Bottom, First 4 bytes
AT91C_EMACB_ELE           EQU (0xFFFC4078) ;- (EMACB) Excessive Length Errors Register
AT91C_EMACB_HRT           EQU (0xFFFC4094) ;- (EMACB) Hash Address Top[63:32]
AT91C_EMACB_SA2L          EQU (0xFFFC40A0) ;- (EMACB) Specific Address 2 Bottom, First 4 bytes
AT91C_EMACB_RRE           EQU (0xFFFC406C) ;- (EMACB) Receive Ressource Error Register
AT91C_EMACB_FRO           EQU (0xFFFC404C) ;- (EMACB) Frames Received OK Register
AT91C_EMACB_TPQ           EQU (0xFFFC40BC) ;- (EMACB) Transmit Pause Quantum Register
AT91C_EMACB_ISR           EQU (0xFFFC4024) ;- (EMACB) Interrupt Status Register
AT91C_EMACB_TSR           EQU (0xFFFC4014) ;- (EMACB) Transmit Status Register
AT91C_EMACB_RLE           EQU (0xFFFC4088) ;- (EMACB) Receive Length Field Mismatch Register
AT91C_EMACB_USF           EQU (0xFFFC4080) ;- (EMACB) Undersize Frames Register
AT91C_EMACB_WOL           EQU (0xFFFC40C4) ;- (EMACB) Wake On LAN Register
AT91C_EMACB_TPF           EQU (0xFFFC408C) ;- (EMACB) Transmitted Pause Frames Register
AT91C_EMACB_PTR           EQU (0xFFFC4038) ;- (EMACB) Pause Time Register
AT91C_EMACB_TUND          EQU (0xFFFC4064) ;- (EMACB) Transmit Underrun Error Register
AT91C_EMACB_MAN           EQU (0xFFFC4034) ;- (EMACB) PHY Maintenance Register
AT91C_EMACB_RJA           EQU (0xFFFC407C) ;- (EMACB) Receive Jabbers Register
AT91C_EMACB_SA4L          EQU (0xFFFC40B0) ;- (EMACB) Specific Address 4 Bottom, First 4 bytes
AT91C_EMACB_CSE           EQU (0xFFFC4068) ;- (EMACB) Carrier Sense Error Register
AT91C_EMACB_HRB           EQU (0xFFFC4090) ;- (EMACB) Hash Address Bottom[31:0]
AT91C_EMACB_ALE           EQU (0xFFFC4054) ;- (EMACB) Alignment Error Register
AT91C_EMACB_SA1L          EQU (0xFFFC4098) ;- (EMACB) Specific Address 1 Bottom, First 4 bytes
AT91C_EMACB_NCR           EQU (0xFFFC4000) ;- (EMACB) Network Control Register
AT91C_EMACB_FTO           EQU (0xFFFC4040) ;- (EMACB) Frames Transmitted OK Register
AT91C_EMACB_ECOL          EQU (0xFFFC4060) ;- (EMACB) Excessive Collision Register
AT91C_EMACB_DTF           EQU (0xFFFC4058) ;- (EMACB) Deferred Transmission Frame Register
AT91C_EMACB_SA4H          EQU (0xFFFC40B4) ;- (EMACB) Specific Address 4 Top, Last 2 bytes
AT91C_EMACB_FCSE          EQU (0xFFFC4050) ;- (EMACB) Frame Check Sequence Error Register
AT91C_EMACB_TID           EQU (0xFFFC40B8) ;- (EMACB) Type ID Checking Register
AT91C_EMACB_PFR           EQU (0xFFFC403C) ;- (EMACB) Pause Frames received Register
AT91C_EMACB_IDR           EQU (0xFFFC402C) ;- (EMACB) Interrupt Disable Register
AT91C_EMACB_SA3H          EQU (0xFFFC40AC) ;- (EMACB) Specific Address 3 Top, Last 2 bytes
AT91C_EMACB_NSR           EQU (0xFFFC4008) ;- (EMACB) Network Status Register
AT91C_EMACB_MCF           EQU (0xFFFC4048) ;- (EMACB) Multiple Collision Frame Register
AT91C_EMACB_RBQP          EQU (0xFFFC4018) ;- (EMACB) Receive Buffer Queue Pointer
AT91C_EMACB_RSR           EQU (0xFFFC4020) ;- (EMACB) Receive Status Register
AT91C_EMACB_SA2H          EQU (0xFFFC40A4) ;- (EMACB) Specific Address 2 Top, Last 2 bytes
AT91C_EMACB_NCFGR         EQU (0xFFFC4004) ;- (EMACB) Network Configuration Register
AT91C_EMACB_LCOL          EQU (0xFFFC405C) ;- (EMACB) Late Collision Register
/* - ========== Register definition for UDP peripheral ========== */
AT91C_UDP_GLBSTATE        EQU (0xFFFA4004) ;- (UDP) Global State Register
AT91C_UDP_FDR             EQU (0xFFFA4050) ;- (UDP) Endpoint FIFO Data Register
AT91C_UDP_RSTEP           EQU (0xFFFA4028) ;- (UDP) Reset Endpoint Register
AT91C_UDP_FADDR           EQU (0xFFFA4008) ;- (UDP) Function Address Register
AT91C_UDP_NUM             EQU (0xFFFA4000) ;- (UDP) Frame Number Register
AT91C_UDP_IDR             EQU (0xFFFA4014) ;- (UDP) Interrupt Disable Register
AT91C_UDP_IMR             EQU (0xFFFA4018) ;- (UDP) Interrupt Mask Register
AT91C_UDP_CSR             EQU (0xFFFA4030) ;- (UDP) Endpoint Control and Status Register
AT91C_UDP_IER             EQU (0xFFFA4010) ;- (UDP) Interrupt Enable Register
AT91C_UDP_ICR             EQU (0xFFFA4020) ;- (UDP) Interrupt Clear Register
AT91C_UDP_TXVC            EQU (0xFFFA4074) ;- (UDP) Transceiver Control Register
AT91C_UDP_ISR             EQU (0xFFFA401C) ;- (UDP) Interrupt Status Register
/* - ========== Register definition for UHP peripheral ========== */
AT91C_UHP_HcInterruptStatus EQU (0x0050000C) ;- (UHP) Interrupt Status Register
AT91C_UHP_HcCommandStatus EQU (0x00500008) ;- (UHP) Command & status Register
AT91C_UHP_HcRhStatus      EQU (0x00500050) ;- (UHP) Root Hub Status register
AT91C_UHP_HcInterruptDisable EQU (0x00500014) ;- (UHP) Interrupt Disable Register
AT91C_UHP_HcPeriodicStart EQU (0x00500040) ;- (UHP) Periodic Start
AT91C_UHP_HcControlCurrentED EQU (0x00500024) ;- (UHP) Endpoint Control and Status Register
AT91C_UHP_HcPeriodCurrentED EQU (0x0050001C) ;- (UHP) Current Isochronous or Interrupt Endpoint Descriptor
AT91C_UHP_HcBulkHeadED    EQU (0x00500028) ;- (UHP) First endpoint register of the Bulk list
AT91C_UHP_HcRevision      EQU (0x00500000) ;- (UHP) Revision
AT91C_UHP_HcBulkCurrentED EQU (0x0050002C) ;- (UHP) Current endpoint of the Bulk list
AT91C_UHP_HcRhDescriptorB EQU (0x0050004C) ;- (UHP) Root Hub characteristics B
AT91C_UHP_HcControlHeadED EQU (0x00500020) ;- (UHP) First Endpoint Descriptor of the Control list
AT91C_UHP_HcFmRemaining   EQU (0x00500038) ;- (UHP) Bit time remaining in the current Frame
AT91C_UHP_HcHCCA          EQU (0x00500018) ;- (UHP) Pointer to the Host Controller Communication Area
AT91C_UHP_HcLSThreshold   EQU (0x00500044) ;- (UHP) LS Threshold
AT91C_UHP_HcRhPortStatus  EQU (0x00500054) ;- (UHP) Root Hub Port Status Register
AT91C_UHP_HcInterruptEnable EQU (0x00500010) ;- (UHP) Interrupt Enable Register
AT91C_UHP_HcFmNumber      EQU (0x0050003C) ;- (UHP) Frame number
AT91C_UHP_HcFmInterval    EQU (0x00500034) ;- (UHP) Bit time between 2 consecutive SOFs
AT91C_UHP_HcControl       EQU (0x00500004) ;- (UHP) Operating modes for the Host Controller
AT91C_UHP_HcBulkDoneHead  EQU (0x00500030) ;- (UHP) Last completed transfer descriptor
AT91C_UHP_HcRhDescriptorA EQU (0x00500048) ;- (UHP) Root Hub characteristics A
/* - ========== Register definition for HECC peripheral ========== */
/* - ========== Register definition for HISI peripheral ========== */
AT91C_HISI_PSIZE          EQU (0xFFFC0020) ;- (HISI) Preview Size Register
AT91C_HISI_CR1            EQU (0xFFFC0000) ;- (HISI) Control Register 1
AT91C_HISI_R2YSET1        EQU (0xFFFC003C) ;- (HISI) Color Space Conversion Register
AT91C_HISI_CDBA           EQU (0xFFFC002C) ;- (HISI) Codec Dma Address Register
AT91C_HISI_IDR            EQU (0xFFFC0010) ;- (HISI) Interrupt Disable Register
AT91C_HISI_R2YSET2        EQU (0xFFFC0040) ;- (HISI) Color Space Conversion Register
AT91C_HISI_Y2RSET1        EQU (0xFFFC0034) ;- (HISI) Color Space Conversion Register
AT91C_HISI_PFBD           EQU (0xFFFC0028) ;- (HISI) Preview Frame Buffer Address Register
AT91C_HISI_CR2            EQU (0xFFFC0004) ;- (HISI) Control Register 2
AT91C_HISI_Y2RSET0        EQU (0xFFFC0030) ;- (HISI) Color Space Conversion Register
AT91C_HISI_PDECF          EQU (0xFFFC0024) ;- (HISI) Preview Decimation Factor Register
AT91C_HISI_IMR            EQU (0xFFFC0014) ;- (HISI) Interrupt Mask Register
AT91C_HISI_IER            EQU (0xFFFC000C) ;- (HISI) Interrupt Enable Register
AT91C_HISI_R2YSET0        EQU (0xFFFC0038) ;- (HISI) Color Space Conversion Register
AT91C_HISI_SR             EQU (0xFFFC0008) ;- (HISI) Status Register

